leetcode_2443_sum_of_number_and_its_reverse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2443. Sum of Number and Its Reverse</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2443. Sum of Number and Its Reverse</h1>

<div id="outline-container-org2e89328" class="outline-2">
<h2 id="org2e89328">Understand the problem</h2>
<div class="outline-text-2" id="text-org2e89328">
<p>
Given an integer \(num\), return \(True\) if there is a non-negative integer \(x\) such that \(x+r(x)=num\) where \(r(x)\) is the integer generate by reverting the digits of \(x\).
</p>
</div>

<div id="outline-container-org3ee2c07" class="outline-3">
<h3 id="org3ee2c07">Useful prompts</h3>
<div class="outline-text-3" id="text-org3ee2c07">
<ul class="org-ul">
<li><a href="can_we_use_brute_force_to_solve_the_problem.html#ID-29512D97-A54D-42F9-A8C7-C3422881933B">Can we use brute-force to solve the problem?</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge91130e" class="outline-2">
<h2 id="orge91130e">Devise a plan</h2>
<div class="outline-text-2" id="text-orge91130e">
<p>
There are only \(num\) possible numbers.  Iterate over all them and return \(True\) if one satisfy the condition.
</p>
</div>

<div id="outline-container-org22a5ebd" class="outline-3">
<h3 id="org22a5ebd">Carry out the plan</h3>
<div class="outline-text-3" id="text-org22a5ebd">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sumOfNumberAndReverse</span>(<span style="font-weight: bold;">self</span>, num: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">bool</span>:
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(num + 1):
            <span style="font-weight: bold;">if</span> i + <span style="font-weight: bold;">int</span>(<span style="font-weight: bold;">str</span>(i)[::-1]) == num:
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>